import streamlit as st
import pandas as pd
import altair as alt
import plotly.express as px
import plotly.graph_objs as go
from wordcloud import WordCloud

# Page configuration
st.set_page_config(
    page_title="สวัสดิการและสิ่งอำนวยความสะดวกของมหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต",
    page_icon="🏂",
    layout="wide",
    initial_sidebar_state="expanded")

alt.themes.enable("dark")


#######################
# Load data
df_reshaped = pd.read_csv('แบบสำรวจสวัสดิการและสิ่งอำนวยความสะดวก_มธ.csv')

#######################
# Sidebar
with st.sidebar:
    st.title('🏂 สวัสดิการและสิ่งอำนวยความสะดวกของมหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต')

    gender_list = list(df_reshaped['เพศ'].unique())[::-1]
    selected_gender = st.selectbox('Select a ', gender_list)
    df_selected_gender = df_reshaped[df_reshaped['เพศ'] == selected_gender]

    year_list = list(df_reshaped['เลขรหัสนักศึกษา 2 ตัวแรก (เช่น รหัสนักศึกษา 65XXXXXXXX ตอบ 65)'].unique())[::-1]
    selected_year = st.selectbox('Select a year', year_list)
    df_selected_year = df_reshaped[df_reshaped['เลขรหัสนักศึกษา 2 ตัวแรก (เช่น รหัสนักศึกษา 65XXXXXXXX ตอบ 65)'] == selected_year]

    fac_list = list(df_reshaped['คณะ'].unique())[::-1]
    selected_fac = st.selectbox('Select a faculty', fac_list)
    df_selected_fac = df_reshaped[df_reshaped['คณะ'] == selected_fac]

#############################
#condition
if selected_gender and selected_year and  selected_fac :
    filter_df = df_reshaped[(df_reshaped['เพศ']== selected_gender) & (df_reshaped['เลขรหัสนักศึกษา 2 ตัวแรก (เช่น รหัสนักศึกษา 65XXXXXXXX ตอบ 65)'] == selected_year) & (df_reshaped['คณะ']==selected_fac)] 
    st.header('Total '+str(filter_df.count()['เพศ'])+' people',divider='grey')
    #st.write(filter_df)

##############################
#Dataprep

#พอใจการศึกษา
    df_Select_1 = filter_df[['1. ความพึงพอใจด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]',
    '1. ความพึงพอใจด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]',
    '1. ความพึงพอใจด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]',
    '1. ความพึงพอใจด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]',
    '1. ความพึงพอใจด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]',
    '1. ความพึงพอใจด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]',
    '1. ความพึงพอใจด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]']]

    df_Select_1.isnull().sum()

    AVG1 = [df_Select_1['1. ความพึงพอใจด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]'].mean(),
    df_Select_1['1. ความพึงพอใจด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]'].mean(),
    df_Select_1['1. ความพึงพอใจด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]'].mean(),
    df_Select_1['1. ความพึงพอใจด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]'].mean(),
    df_Select_1['1. ความพึงพอใจด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]'].mean(),
    df_Select_1['1. ความพึงพอใจด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]'].mean(),
    df_Select_1['1. ความพึงพอใจด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]'].mean()]

#พอใจสุขอนามัย
    df_Select_2 = filter_df[['2. ความพึงพอใจด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]',
    '2. ความพึงพอใจด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]',
    '2. ความพึงพอใจด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]',
    '2. ความพึงพอใจด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]']]

    df_Select_2.isnull().sum()

    AVG2 = [df_Select_2['2. ความพึงพอใจด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]'].mean(),
    df_Select_2['2. ความพึงพอใจด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]'].mean(),
    df_Select_2['2. ความพึงพอใจด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]'].mean(),
    df_Select_2['2. ความพึงพอใจด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]'].mean()]

#พอใจความปลอดภัย
    df_Select_3 = filter_df[['3. ความพึงพอใจด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]',
    '3. ความพึงพอใจด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]',
    '3. ความพึงพอใจด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]',
    '3. ความพึงพอใจด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]',
    '3. ความพึงพอใจด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]']]

    df_Select_3.isnull().sum()

    AVG3 = [df_Select_3['3. ความพึงพอใจด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]'].mean(),
        df_Select_3['3. ความพึงพอใจด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]'].mean(),
        df_Select_3['3. ความพึงพอใจด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]'].mean(),
        df_Select_3['3. ความพึงพอใจด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]'].mean(),
        df_Select_3['3. ความพึงพอใจด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]'].mean()]
    
#พอใจที่พัก
    df_Select_4 = filter_df[['4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]',
    '4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]',
    '4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]',
    '4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]']]

    df_Select_4.isnull().sum()

    AVG4 = [df_Select_4['4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]'].mean(),
        df_Select_4['4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]'].mean(),
        df_Select_4['4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]'].mean(),
        df_Select_4['4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]'].mean()]
    
#พอใจกิจกรรม
    df_Select_5 = filter_df[['5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]',
    '5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]',
    '5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]',
    '5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]']]

    df_Select_5.isnull().sum()

    AVG5 = [df_Select_5['5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]'].mean(),
        df_Select_5['5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]'].mean(),
        df_Select_5['5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]'].mean(),
        df_Select_5['5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]'].mean()]
    
#พอใจอาคาร
    df_Select_6 = filter_df[['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]',
    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]',
    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]',
    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]',
    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]',
    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]',
    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]',
    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับพักผ่อน (สวนหย่อม)]',
    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]']]

    df_Select_6.isnull().sum()

    AVG6 = [df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]'].mean(),
    df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]'].mean(),
    df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]'].mean(),
    df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]'].mean(),
    df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]'].mean(),
    df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]'].mean(),
    df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]'].mean(),
    df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับพักผ่อน (สวนหย่อม)]'].mean(),
    df_Select_6['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]'].mean()]

#ระดับปัญหาการศึกษา
    df_Select_7 = filter_df[['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]',
    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]',
    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]',
    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]',
    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]',
    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]',
    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]']]

    df_Select_7.isnull().sum()

    AVG7 = [df_Select_7['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]'].mean(),
    df_Select_7['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]'].mean(),
    df_Select_7['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]'].mean(),
    df_Select_7['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]'].mean(),
    df_Select_7['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]'].mean(),
    df_Select_7['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]'].mean(),
    df_Select_7['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]'].mean()]

#ระดับปัญหาสุขอนามัย
    df_Select_8 = filter_df[['2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]',
    '2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]',
    '2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]',
    '2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]']]

    df_Select_8.isnull().sum()

    AVG8 = [df_Select_8['2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]'].mean(),
    df_Select_8['2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]'].mean(),
    df_Select_8['2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]'].mean(),
    df_Select_8['2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]'].mean()]

#ระดับปัญหาความปลอดภัย
    df_Select_9 = filter_df[['3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]',
    '3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]',
    '3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]',
    '3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]',
    '3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]']]

    df_Select_9.isnull().sum()

    AVG9 = [df_Select_9['3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]'].mean(),
        df_Select_9['3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]'].mean(),
        df_Select_9['3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]'].mean(),
        df_Select_9['3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]'].mean(),
        df_Select_9['3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]'].mean()] 

#ระดับปัญหาที่พัก
    df_Select_10 = filter_df[['4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]',
    '4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]',
    '4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]',
    '4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]']]

    df_Select_10.isnull().sum()

    AVG10 = [df_Select_10['4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]'].mean(),
        df_Select_10['4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]'].mean(),
        df_Select_10['4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]'].mean(),
        df_Select_10['4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]'].mean()]

#ระดับปัญหากิจกรรม
    df_Select_11 = filter_df[['5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]',
    '5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]',
    '5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]',
    '5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]']]

    df_Select_11.isnull().sum()

    AVG11 = [df_Select_11['5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]'].mean(),
        df_Select_11['5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]'].mean(),
        df_Select_11['5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]'].mean(),
        df_Select_11['5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]'].mean()]
    
#ระดับปัญหาอาคาร
    df_Select_12 = filter_df[['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]',
    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]',
    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]',
    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]',
    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]',
    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]',
    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]',
    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับสำหรับพักผ่อน (สวนหย่อม)]',
    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]']]

    df_Select_12.isnull().sum()

    AVG12 = [df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]'].mean(),
        df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]'].mean(),
        df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]'].mean(),
        df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]'].mean(),
        df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]'].mean(),
        df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]'].mean(),
        df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]'].mean(),
        df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับสำหรับพักผ่อน (สวนหย่อม)]'].mean(),
        df_Select_12['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]'].mean()]

#ความต้องการการศึกษา
    df_Select_13 = filter_df[['1. ความต้องการในด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]',
    '1. ความต้องการในด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]',
    '1. ความต้องการในด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]',
    '1. ความต้องการในด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]',
    '1. ความต้องการในด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]',
    '1. ความต้องการในด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]',
    '1. ความต้องการในด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]']]

    df_Select_13.isnull().sum()

    AVG13 = [df_Select_13['1. ความต้องการในด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]'].mean(),
        df_Select_13['1. ความต้องการในด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]'].mean(),
        df_Select_13['1. ความต้องการในด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]'].mean(),
        df_Select_13['1. ความต้องการในด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]'].mean(),
        df_Select_13['1. ความต้องการในด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]'].mean(),
        df_Select_13['1. ความต้องการในด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]'].mean(),
        df_Select_13['1. ความต้องการในด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]'].mean()]

#ความต้องการสุขอนามัย
    df_Select_14 = filter_df[['2.  ความต้องการในด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]',
    '2.  ความต้องการในด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]',
    '2.  ความต้องการในด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]',
    '2.  ความต้องการในด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]']]

    df_Select_14.isnull().sum()

    AVG14 = [df_Select_14['2.  ความต้องการในด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]'].mean(),
    df_Select_14['2.  ความต้องการในด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]'].mean(),
    df_Select_14['2.  ความต้องการในด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]'].mean(),
    df_Select_14['2.  ความต้องการในด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]'].mean()]

#ความต้องการความปลอดภัย
    df_Select_15 = filter_df[['3. ความต้องการในด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]',
    '3. ความต้องการในด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]',
    '3. ความต้องการในด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]',
    '3. ความต้องการในด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]',
    '3. ความต้องการในด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]']]

    df_Select_15.isnull().sum()

    AVG15 = [df_Select_15['3. ความต้องการในด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]'].mean(),
        df_Select_15['3. ความต้องการในด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]'].mean(),
        df_Select_15['3. ความต้องการในด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]'].mean(),
        df_Select_15['3. ความต้องการในด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]'].mean(),
        df_Select_15['3. ความต้องการในด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]'].mean()]
    
#ความต้องการที่พัก
    df_Select_16 = filter_df[['4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]',
    '4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]',
    '4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]',
    '4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]']]

    df_Select_16.isnull().sum()

    AVG16 = [df_Select_16['4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]'].mean(),
        df_Select_16['4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]'].mean(),
        df_Select_16['4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]'].mean(),
        df_Select_16['4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]'].mean()]

#ความต้องการกิจกรรมนันทนาการ
    df_Select_17 = filter_df[['5.  ความต้องการในด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]',
    '5.  ความต้องการในด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]',
    '5.  ความต้องการในด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]',
    '5.  ความต้องการในด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]']]

    df_Select_17.isnull().sum()

    AVG17 = [df_Select_17['5.  ความต้องการในด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]'].mean(),
        df_Select_17['5.  ความต้องการในด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]'].mean(),
        df_Select_17['5.  ความต้องการในด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]'].mean(),
        df_Select_17['5.  ความต้องการในด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]'].mean()]

#ความต้องการอาคาร
    df_Select_18 = filter_df[['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]',
    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]',
    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]',
    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]',
    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]',
    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]',
    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]',
    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับสำหรับพักผ่อน (สวนหย่อม)]',
    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]']]

    df_Select_18.isnull().sum()

    AVG18 = [df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]'].mean(),
        df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]'].mean(),
        df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]'].mean(),
        df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]'].mean(),
        df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]'].mean(),
        df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]'].mean(),
        df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]'].mean(),
        df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับสำหรับพักผ่อน (สวนหย่อม)]'].mean(),
        df_Select_18['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]'].mean()]
    
#mean

#เตรียมข้อมูลค่าเฉลี่ยของ 6 ด้าน ใน 3 ประเด็น คือ พึงพอใจ ปัญหา ความต้องการ
    total_edu_1 = filter_df[['1. ความพึงพอใจด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]',
                    '1. ความพึงพอใจด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]',
                    '1. ความพึงพอใจด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]',
                    '1. ความพึงพอใจด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]',
                    '1. ความพึงพอใจด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]',
                    '1. ความพึงพอใจด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]',
                    '1. ความพึงพอใจด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]']].mean()

    total_edu_2 = filter_df[['1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]',
                    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]',
                    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]',
                    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]',
                    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]',
                    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]',
                    '1. ระดับปัญหาที่พบในด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]']].mean()


    total_edu_3 = filter_df[['1. ความต้องการในด้านการบริการทางศึกษา [1. การบริการห้องสมุดที่ดี]',
                    '1. ความต้องการในด้านการบริการทางศึกษา [2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน]',
                    '1. ความต้องการในด้านการบริการทางศึกษา [3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน]',
                    '1. ความต้องการในด้านการบริการทางศึกษา [4. การจัดกิจกรรมเชิงวิชาการ]',
                    '1. ความต้องการในด้านการบริการทางศึกษา [5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย]',
                    '1. ความต้องการในด้านการบริการทางศึกษา [6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้]',
                    '1. ความต้องการในด้านการบริการทางศึกษา [7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ]']].mean()

    total_helth_1 = filter_df[['2. ความพึงพอใจด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]',
                    '2. ความพึงพอใจด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]',
                    '2. ความพึงพอใจด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]',
                    '2. ความพึงพอใจด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]' ]].mean()

    total_helth_2 = filter_df[['2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]',
                    '2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]',
                    '2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]',
                    '2.  ระดับปัญหาที่พบในด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]' ]].mean()

    total_helth_3 = filter_df[['2.  ความต้องการในด้านสุขภาพอนามัย [1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา]',
                    '2.  ความต้องการในด้านสุขภาพอนามัย [2. การบริการตรวจสุขภาพร่างกายและจิตใจ]',
                    '2.  ความต้องการในด้านสุขภาพอนามัย [3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ]',
                    '2.  ความต้องการในด้านสุขภาพอนามัย [4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ]' ]].mean()

    total_safety_1 = filter_df[['3. ความพึงพอใจด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]',
                    '3. ความพึงพอใจด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]',
                    '3. ความพึงพอใจด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]',
                    '3. ความพึงพอใจด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]',
                    '3. ความพึงพอใจด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]' ]].mean()

    total_safety_2 = filter_df[['3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]',
                    '3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]',
                    '3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]',
                    '3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]',
                    '3.  ระดับปัญหาที่พบในด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]' ]].mean()

    total_safety_3 = filter_df[['3. ความต้องการในด้านการรักษาความปลอดภัย [1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ]',
                    '3. ความต้องการในด้านการรักษาความปลอดภัย [2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ]',
                    '3. ความต้องการในด้านการรักษาความปลอดภัย [3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย]',
                    '3. ความต้องการในด้านการรักษาความปลอดภัย [4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ]',
                    '3. ความต้องการในด้านการรักษาความปลอดภัย [5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย]' ]].mean()

    total_home_1 = filter_df[['4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]',
                    '4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]',
                    '4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]',
                    '4. ความพึงพอใจด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]']].mean()

    total_home_2 = filter_df[['4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]',
                    '4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]',
                    '4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]',
                    '4.  ระดับปัญหาที่พบในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]' ]].mean()

    total_home_3 = filter_df[['4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา]',
                    '4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก]',
                    '4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย]',
                    '4.  ความต้องการในด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) [4. เว็บไซต์ Baan TU]' ]].mean()


    total_activity_1 = filter_df[['5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]',
                        '5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]',
                        '5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]',
                        '5. ความพึงพอใจด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]']].mean()

    total_activity_2 = filter_df[['5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]',
                    '5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]',
                    '5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]',
                    '5.  ระดับปัญหาที่พบในด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]' ]].mean()

    total_activity_3 = filter_df[['5.  ความต้องการในด้านกิจกรรมและนันทนาการ [1. การบริการFitness และสนามกีฬาต่างๆ]',
                    '5.  ความต้องการในด้านกิจกรรมและนันทนาการ [2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม]',
                    '5.  ความต้องการในด้านกิจกรรมและนันทนาการ [3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ]',
                    '5.  ความต้องการในด้านกิจกรรมและนันทนาการ [4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ]' ]].mean()

    total_place_1 = filter_df[['6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]',
                    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]',
                    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]',
                    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]',
                    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]',
                    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]',
                    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]',
                    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับพักผ่อน (สวนหย่อม)]',
                    '6.  ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]']].mean()


    total_place_2 = filter_df[['6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]',
                    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]',
                    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]',
                    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]',
                    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]',
                    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]',
                    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]',
                    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับสำหรับพักผ่อน (สวนหย่อม)]',
                    '6.   ระดับปัญหาที่พบในด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]']].mean()


    total_place_3 = filter_df[['6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ]',
                    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย]',
                    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [3. ที่จอดรถอย่างเพียงพอ เหมาะสม]',
                    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ]',
                    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย]',
                    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ]',
                    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ]',
                    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [8. การบริการสถานที่สำหรับสำหรับพักผ่อน (สวนหย่อม)]',
                    '6.   ความต้องการในด้านอาคาร สถานที่ และสิ่งแวดล้อม [9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์]']].mean()

    total_mean_edu1 = total_edu_1.mean()
    total_mean_edu2 = total_edu_2.mean()
    total_mean_edu3 = total_edu_3.mean()

    total_mean_helth1 = total_helth_1.mean()
    total_mean_helth2 = total_helth_2.mean()
    total_mean_helth3 = total_helth_3.mean()

    total_mean_safety1 = total_safety_1.mean()
    total_mean_safety2 = total_safety_2.mean()
    total_mean_safety3 = total_safety_3.mean()

    total_mean_home1 = total_home_1.mean()
    total_mean_home2 = total_home_2.mean()
    total_mean_home3 = total_home_3.mean()

    total_mean_activity1 = total_activity_1.mean()
    total_mean_activity2 = total_activity_2.mean()
    total_mean_activity3 = total_activity_3.mean()

    total_mean_place1 = total_place_1.mean()
    total_mean_place2 = total_place_2.mean()
    total_mean_place3 = total_place_3.mean()

    COLORedu = ['#88a4c9',  '#bbe6dd',  '#ff8696',  '#fde8b2']
    COLORhelth =['#d0cfcd']
    COLORsafety =['#404e67'] 
    COLORhome = ['#00202e']
    COLORact =['#5f8575',  '#ffc9bf',  '#c9877c',  ]
    COLORplace =[ '#94b3c4']

    COLOR_edu = ['#642915',  '#963e20',  '#c7522a',  '#e5c185',  '#fbf2c4',  '#74a892',  '#008585',  '#006464', '#004343']
    COLOR_helth =['#d0cfcd', '#88a29b', '#55a69f', '#016970', '#02555e', '#dd9984', '#c1806c', '#966552', '#4c3d37']
    COLOR_safety =['#404e67', '#809bce', '#95b8d1', '#b8e0d4', '#d6eadf', '#eac4d5', '#d1625c', '#e89c81', '#ffd6a5'] 
    COLOR_home = ['#00202e',  '#003f5c',  '#2c4875',  '#8a508f',  '#bc5090',  '#f26852',  '#ff8531',  '#ffa600',  '#ffd380']
    COLOR_act =['#778f76', '#e2dbd4', '#ffd08b', '#e38859', '#aea6bd', '#c0d6ff', '#e0ebff', '#ffcfcf', '#d3a0b3'] 
    COLOR_place =['#606721', '#8f9361', '#db9929', '#cd702a', '#c77874', '#c8a89c', '#45a6ac', '#8cc8d2', '#c9e3e4']

############################################################################################3
    col1, col2 = st.columns(2)
    with col1:
        st.markdown('### ระดับค่าเฉลี่ย')
        # สร้างข้อมูลตัวอย่าง
        data = {
            'ความพึงพอใจ': [total_mean_edu1, total_mean_helth1, total_mean_safety1, total_mean_home1, total_mean_activity1, total_mean_place1],
            'ระดับปัญหา': [total_mean_edu2, total_mean_helth2, total_mean_safety2, total_mean_home2, total_mean_activity2, total_mean_place2],
            'ความต้องการ': [total_mean_edu3, total_mean_helth3, total_mean_safety3, total_mean_home3, total_mean_activity3, total_mean_place3]
        }

        # ใช้ pd.DataFrame เพื่อสร้าง DataFrame จากข้อมูลตัวอย่าง
        df = pd.DataFrame(data, index=['การศึกษา', 'สุขภาพอนามัย', 'ความปลอดภัย', 'ที่อยู่อาศัย', 'กิจกรรมนันทนาการ', 'อาคาร สถานที่ และสิ่งแวดล้อม'])

        st.write(df)
        # เพิ่มคำอธิบายนอกตาราง
        st.write("หมายเหตุ: ระดับค่าเฉลี่ย 5 = มากที่สุด , 4 = มาก , 3 = ปานกลาง , 2 = น้อย และ 1 = น้อยที่สุด")
    with col2 :

        labels = ['ความพึงพอใจ', 'ระดับปัญหา', 'ความต้องการ']

        # ข้อมูลเกี่ยวกับความพึงพอใจด้านการศึกษา
        values_edu1 = [total_mean_edu1, total_mean_edu2, total_mean_edu3]

        # ข้อมูลเกี่ยวกับความพึงพอใจด้านสุขภาพอนามัย
        values_helth1 = [total_mean_helth1, total_mean_helth2, total_mean_helth3]

        # ข้อมูลเกี่ยวกับความพึงพอใจด้านความปลอดภัย
        values_safety1 = [total_mean_safety1, total_mean_safety2, total_mean_safety3]

        # ข้อมูลเกี่ยวกับความพึงพอใจด้านที่อยู่อาศัย
        values_home1 = [total_mean_home1, total_mean_home2, total_mean_home3]

        # ข้อมูลเกี่ยวกับความพึงพอใจด้านกิจกรรมนันทนาการ
        values_activity1 = [total_mean_activity1, total_mean_activity2, total_mean_activity3]

        # ข้อมูลเกี่ยวกับความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม
        values_place1 = [total_mean_place1, total_mean_place2, total_mean_place3]

        # Plotly traces
        trace_edu = go.Scatter(x=labels, y=values_edu1, mode='lines+markers', name='การศึกษา')
        trace_helth = go.Scatter(x=labels, y=values_helth1, mode='lines+markers', name='สุขภาพอนามัย')
        trace_safety = go.Scatter(x=labels, y=values_safety1, mode='lines+markers', name='ความปลอดภัย')
        trace_home = go.Scatter(x=labels, y=values_home1, mode='lines+markers', name='ที่อยู่อาศัย')
        trace_activity = go.Scatter(x=labels, y=values_activity1, mode='lines+markers', name='กิจกรรมนันทนาการ')
        trace_place = go.Scatter(x=labels, y=values_place1, mode='lines+markers', name='อาคาร สถานที่ และสิ่งแวดล้อม')

        # Plotly layout
        layout = go.Layout(
            yaxis=dict(title='ค่าเฉลี่ย'),
            legend=dict(orientation='h'),
        )

        # Plotly figure
        fig = go.Figure(data=[trace_edu, trace_helth, trace_safety, trace_home, trace_activity, trace_place], layout=layout)
        st.plotly_chart(fig, use_container_width=True) 



#######################################################################################
# Dashboard Main Panel


    st.markdown('### สวัสดิการที่เคยใช้และสิ่งอำนวยความสะดวก ')

    def count_values(df_column):
        return pd.Series([item for sublist in df_column.dropna() for item in sublist]).value_counts()

    #########เคยใช้การศึกษา
    # read and count data
    edu = filter_df['คุณเคยใช้สวัสดิการด้านการบริการทางการศึกษาอะไรบ้าง ?'].str.split(", ")
    a = pd.Series([item for sublist in edu for item in sublist])
    a = a.value_counts().reset_index()
    a.columns = ['สวัสดิการด้านการศึกษา', 'จำนวนคน']

    # use Plotly Express bar chart
    fig = px.bar(a, x='จำนวนคน', y='สวัสดิการด้านการศึกษา', orientation='h',
                 color_discrete_sequence=COLORedu,
                title='จำนวนนักศึกษาที่เคยใช้สวัสดิการด้านการศึกษา',
                labels={'จำนวนคน': 'จำนวนคน', 'สวัสดิการด้านการศึกษา': 'สวัสดิการด้านการศึกษา'})
    st.plotly_chart(fig,use_container_width=True)

    #######เคยใช้สุขอนามัย
    health = filter_df['คุณเคยใช้สวัสดิการด้านสุขภาพอนามัยอะไรบ้าง ?'].str.split(", ")
    health_a = count_values(health).reset_index()
    health_a.columns = ['สวัสดิการด้านการสุขภาพอนามัย', 'จำนวนคน']
    
    # use Plotly Express bar chart
    fig = px.bar(health_a, x='จำนวนคน', y='สวัสดิการด้านการสุขภาพอนามัย', orientation='h',
                 color_discrete_sequence=COLORhelth,
                title='จำนวนนักศึกษาที่เคยใช้สวัสดิการด้านการสุขภาพอนามัย',
                labels={'จำนวนคน': 'จำนวนคน', 'สวัสดิการด้านการสุขภาพอนามัย': 'สวัสดิการด้านการสุขภาพอนามัย'})
    # show the figure
    st.plotly_chart(fig,use_container_width=True)

    #########เคยใช้ความปลอดภัย
    safety = filter_df['คุณเคยใช้สวัสดิการด้านการรักษาความปลอดภัยอะไรบ้าง ?'].str.split(", ")
    safety_a = count_values(safety).reset_index()
    safety_a.columns = ['สวัสดิการด้านความปลอดภัย', 'จำนวนคน']

     # use Plotly Express bar chart
    fig = px.bar(health_a, x='จำนวนคน', y='สวัสดิการด้านการสุขภาพอนามัย', orientation='h',
                 color_discrete_sequence=COLORsafety,
                title='จำนวนนักศึกษาที่เคยใช้สวัสดิการด้านความปลอดภัย',
                labels={'จำนวนคน': 'จำนวนคน', 'สวัสดิการด้านความปลอดภัย': 'สวัสดิการด้านความปลอดภัย'})
    # show the figure
    st.plotly_chart(fig,use_container_width=True)

    #########เคยใช้ที่พัก
    home = filter_df['คุณเคยใช้สวัสดิการด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์) อะไรบ้าง ?'].str.split(", ")
    home_a = count_values(home).reset_index()
    home_a.columns = ['สวัสดิการด้านที่พักอาศัย', 'จำนวนคน']

     # use Plotly Express bar chart
    fig = px.bar(home_a, x='จำนวนคน', y='สวัสดิการด้านที่พักอาศัย', orientation='h',
                 color_discrete_sequence=COLORhome,
                title='จำนวนนักศึกษาที่เคยใช้สวัสดิการด้านที่พักอาศัย',
                labels={'จำนวนคน': 'จำนวนคน', 'สวัสดิการด้านที่พักอาศัย': 'สวัสดิการด้านที่พักอาศัย'})
    # show the figure
    st.plotly_chart(fig,use_container_width=True)

    #########เคยใช้กิจกรรม
    activity = filter_df['คุณเคยใช้สวัสดิการด้านกิจกรรมและนันทนาการอะไรบ้าง ?'].str.split(", ")
    activity_a = count_values(activity).reset_index()
    activity_a.columns = ['สวัสดิการด้านกิจกรรมและนันทนาการ', 'จำนวนคน']

     # use Plotly Express bar chart
    fig = px.bar(activity_a, x='จำนวนคน', y='สวัสดิการด้านกิจกรรมและนันทนาการ', orientation='h',
                 color_discrete_sequence=COLORact,
                title='จำนวนนักศึกษาที่เคยใช้วัสดิการด้านกิจกรรมและนันทนาการ',
                labels={'จำนวนคน': 'จำนวนคน', 'สวัสดิการด้านกิจกรรมและนันทนาการ': 'สวัสดิการด้านกิจกรรมและนันทนาการ'})
    # show the figure
    st.plotly_chart(fig,use_container_width=True)

    #########เคยใช้อาคาร
    place = filter_df['คณเคยใช้สวัสดิการด้านอาคาร สถานที่ และสิ่งแวดล้อมอะไรบ้าง ?'].str.split(", ")
    place_a = count_values(place).reset_index()
    place_a.columns = ['สวัสดิการด้านอาคาร สถานที่ และสิ่งแวดล้อม', 'จำนวนคน']

    # use Plotly Express bar chart
    fig = px.bar(place_a, 
                    x='จำนวนคน', 
                    y='สวัสดิการด้านอาคาร สถานที่ และสิ่งแวดล้อม', 
                    orientation='h',
                    title='จำนวนนักศึกษาที่เคยใช้สวัสดิการด้านอาคาร สถานที่ และสิ่งแวดล้อม',
                    color_discrete_sequence=COLORplace,
                    labels={'จำนวนคน': 'จำนวนคน', 'สวัสดิการด้านอาคาร สถานที่ และสิ่งแวดล้อม': 'สวัสดิการด้านอาคาร สถานที่ และสิ่งแวดล้อม'})
    # show the figure
    st.plotly_chart(fig, use_container_width=True)


##############################################################################################################

    st.markdown('### ความพึงพอใจในสวัสดิการและสิ่งอำนวยความสะดวก ')

    ########พอใจการศึกษา
    TYPES1 = ['1. การบริการห้องสมุดที่ดี',
            '2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน',
            '3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน',
            '4. การจัดกิจกรรมเชิงวิชาการ',
            '5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย',
            '6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้',
            '7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ'] # ชื่อแต่ละแท่งในแกน X
    VALUES1 = AVG1 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความพึงพอใจ': TYPES1,
        'ค่าความพึงพอใจเฉลี่ย': VALUES1
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความพึงพอใจ', y='ค่าความพึงพอใจเฉลี่ย',
                title='ความพึงพอใจด้านการศึกษา',
                color='ประเภทของการประเมินความพึงพอใจ',
                color_discrete_sequence=COLOR_edu,
                labels={'ค่าความพึงพอใจเฉลี่ย': 'ค่าความพึงพอใจเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ########พอใจสุขภาพ
    TYPES2 = ['1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา',
         '2. การบริการตรวจสุขภาพร่างกายและจิตใจ',
         '3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ',
         '4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ'] # ชื่อแต่ละแท่งในแกน X
    VALUES2 = AVG2 # ค่าแต่ละแท่งในแกน Y
    COLOR = ['#642915',  '#963e20',  '#c7522a',  '#e5c185',  '#fbf2c4',  '#74a892',  '#008585',  '#006464', '#004343']
    # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความพึงพอใจ': TYPES2,
        'ค่าความพึงพอใจเฉลี่ย': VALUES2
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความพึงพอใจ', y='ค่าความพึงพอใจเฉลี่ย',
                title='ความพึงพอใจด้านสุขภาพอนามัย',
                color='ประเภทของการประเมินความพึงพอใจ',
                color_discrete_sequence=COLOR_helth,
                labels={'ค่าความพึงพอใจเฉลี่ย': 'ค่าความพึงพอใจเฉลี่ย'},
                width=800, height=600)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ########พอใจความปลอดภัย
    TYPES3 = ['1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ',
            '2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ',
            '3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย',
            '4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ',
            '5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย'] # ชื่อแต่ละแท่งในแกน X
    VALUES3 = AVG3 # ค่าแต่ละแท่งในแกน Y       
        # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
            'ประเภทของการประเมินความพึงพอใจ': TYPES3,
            'ค่าความพึงพอใจเฉลี่ย': VALUES3
        }
    df_avg = pd.DataFrame(data)

        # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความพึงพอใจ', y='ค่าความพึงพอใจเฉลี่ย',
                    title='ความพึงพอใจด้านการรักษาความปลอดภัย',
                    color='ประเภทของการประเมินความพึงพอใจ',
                    color_discrete_sequence=COLOR_safety,
                    labels={'ค่าความพึงพอใจเฉลี่ย': 'ค่าความพึงพอใจเฉลี่ย'},
                    width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

        # กำหนดลักษณะของกรอบ
    fig.update_layout(
            margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
            paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
            plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
        )

    st.plotly_chart(fig,use_container_width=True)

    ########พอใจที่พัก
    # creating the dataset
    TYPES4 = ['1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา',
         '2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก',
         '3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย',
         '4. เว็บไซต์ Baan TU'] # ชื่อแต่ละแท่งในแกน X
    VALUES4 = AVG4 # ค่าแต่ละแท่งในแกน Y
        # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความพึงพอใจ': TYPES4,
        'ค่าความพึงพอใจเฉลี่ย': VALUES4
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความพึงพอใจ', y='ค่าความพึงพอใจเฉลี่ย',
                title='ความพึงพอใจด้านที่พัก',
                color='ประเภทของการประเมินความพึงพอใจ',
                color_discrete_sequence=COLOR_home,
                labels={'ค่าความพึงพอใจเฉลี่ย': 'ค่าความพึงพอใจเฉลี่ย'},
                width=800, height=600)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)
    
    ################พอใจกิจกรรม
    TYPES5 = ['1. การบริการFitness และสนามกีฬาต่างๆ',
         '2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม',
         '3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ',
         '4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ'] # ชื่อแต่ละแท่งในแกน X
    VALUES5 = AVG5 # ค่าแต่ละแท่งในแกน Y
    # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความพึงพอใจ': TYPES5,
        'ค่าความพึงพอใจเฉลี่ย': VALUES5
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความพึงพอใจ', y='ค่าความพึงพอใจเฉลี่ย',
                title='ความพึงพอใจด้านกิจกรรมและนันทนาการ',
                color='ประเภทของการประเมินความพึงพอใจ',
                color_discrete_sequence=COLOR_act,
                labels={'ค่าความพึงพอใจเฉลี่ย': 'ค่าความพึงพอใจเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ################พอใจอาคาร
    TYPES6 = ['1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ',
         '2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย',
         '3. ที่จอดรถอย่างเพียงพอ เหมาะสม',
         '4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ',
         '5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย',
         '6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ',
         '7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ',
         '8. การบริการสถานที่สำหรับพักผ่อน (สวนหย่อม)',
         '9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์'] # ชื่อแต่ละแท่งในแกน X
    VALUES6 = AVG6 # ค่าแต่ละแท่งในแกน Y

    # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความพึงพอใจ': TYPES6,
        'ค่าความพึงพอใจเฉลี่ย': VALUES6
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความพึงพอใจ', y='ค่าความพึงพอใจเฉลี่ย',
                title='ความพึงพอใจด้านอาคาร สถานที่ และสิ่งแวดล้อม',
                color='ประเภทของการประเมินความพึงพอใจ',
                color_discrete_sequence=COLOR_place,
                labels={'ค่าความพึงพอใจเฉลี่ย': 'ค่าความพึงพอใจเฉลี่ย'},
                width=800, height=600)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)



###################################################################################################
    st.markdown('### ระดับปัญหาในสวัสดิการและสิ่งอำนวยความสะดวก ')

    #####ปัญหาการศึกษา
    TYPES7 = ['1. การบริการห้องสมุดที่ดี',
         '2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน',
         '3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน',
         '4. การจัดกิจกรรมเชิงวิชาการ',
         '5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย',
         '6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้',
         '7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ'] # ชื่อแต่ละแท่งในแกน X
    VALUES7 = AVG7 # ค่าแต่ละแท่งในแกน Y
    # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินระดับปัญหา': TYPES7,
        'ค่าระดับปัญหาเฉลี่ย': VALUES7
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินระดับปัญหา', y='ค่าระดับปัญหาเฉลี่ย',
                title='ระดับปัญหาที่พบในด้านการบริการทางศึกษา',
                color='ประเภทของการประเมินระดับปัญหา',
                color_discrete_sequence=COLOR_edu,
                labels={'ค่าระดับปัญหาเฉลี่ย': 'ค่าระดับปัญหาเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ###ปัญหาสุขภาพ
    TYPES8 = ['1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา',
            '2. การบริการตรวจสุขภาพร่างกายและจิตใจ',
            '3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ',
            '4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ'] # ชื่อแต่ละแท่งในแกน X
    VALUES8 = AVG8 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินระดับปัญหา': TYPES8,
        'ระดับปัญหาเฉลี่ย': VALUES8
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินระดับปัญหา', y='ระดับปัญหาเฉลี่ย',
                title='ระดับปัญหาด้านสุขอนามัย',
                color='ประเภทของการประเมินระดับปัญหา',
                color_discrete_sequence=COLOR_helth,
                labels={'ระดับปัญหาเฉลี่ย': 'ระดับปัญหาเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ###ปัญหาปลอดภัย
    TYPES9 = ['1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ',
            '2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ',
            '3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย',
            '4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ',
            '5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย'] # ชื่อแต่ละแท่งในแกน X
    VALUES9 = AVG9 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินระดับปัญหา': TYPES9,
        'ระดับปัญหาเฉลี่ย': VALUES9
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินระดับปัญหา', y='ระดับปัญหาเฉลี่ย',
                title='ระดับปัญหาด้านความปลอดภัย',
                color='ประเภทของการประเมินระดับปัญหา',
                color_discrete_sequence= COLOR_safety,
                labels={'ระดับปัญหาเฉลี่ย': 'ระดับปัญหาเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ###ปัญหาที่พัก
    TYPES10 = ['1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา',
            '2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก',
            '3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย',
            '4. เว็บไซต์ Baan TU'] # ชื่อแต่ละแท่งในแกน X
    VALUES10 = AVG10 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินระดับปัญหา': TYPES10,
        'ระดับปัญหาเฉลี่ย': VALUES10
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินระดับปัญหา', y='ระดับปัญหาเฉลี่ย',
                title='ระดับปัญหาด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์)',
                color='ประเภทของการประเมินระดับปัญหา',
                color_discrete_sequence= COLOR_home,
                labels={'ระดับปัญหาเฉลี่ย': 'ระดับปัญหาเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ###ปัญหากิจกรรม
    TYPES11 = ['1. การบริการFitness และสนามกีฬาต่างๆ',
            '2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม',
            '3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ',
            '4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ'] # ชื่อแต่ละแท่งในแกน X
    VALUES11 = AVG11 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของระดับปัญหา': TYPES11,
        'ค่าระดับปัญหาเฉลี่ย': VALUES11
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของระดับปัญหา', y='ค่าระดับปัญหาเฉลี่ย',
                title='ระดับปัญหาด้านกิจกรรมและนันทนาการ',
                color='ประเภทของระดับปัญหา',
                color_discrete_sequence= COLOR_act,
                labels={'ค่าระดับปัญหาเฉลี่ย': 'ค่าระดับปัญหาเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )
    st.plotly_chart(fig,use_container_width=True)

    ###ปัญหาอาคาร
    TYPES12 = ['1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ',
            '2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย',
            '3. ที่จอดรถอย่างเพียงพอ เหมาะสม',
            '4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ',
            '5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย',
            '6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ',
            '7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ',
            '8. การบริการสถานที่สำหรับสำหรับพักผ่อน (สวนหย่อม)',
            '9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์'] # ชื่อแต่ละแท่งในแกน X
    VALUES12 = AVG12 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของระดับปัญหา': TYPES12,
        'ค่าระดับปัญหาเฉลี่ย': VALUES12
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของระดับปัญหา', y='ค่าระดับปัญหาเฉลี่ย',
                title='ระดับปัญหาด้านกิจกรรมและนันทนาการ',
                color='ประเภทของระดับปัญหา',
                color_discrete_sequence= COLOR_act,
                labels={'ค่าระดับปัญหาเฉลี่ย': 'ค่าระดับปัญหาเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)


####################################################################################################
    st.markdown('### ความต้องการในสวัสดิการและสิ่งอำนวยความสะดวก ')

    ##ความต้องการศึกษา
    TYPES13 = ['1. การบริการห้องสมุดที่ดี',
            '2. การรับฟังปัญหาและความต้องการของนักศึกษาต่อการจัดการเรียนการสอน',
            '3. การให้ข้อมูลข่าวสารเกี่ยวกับการศึกษา/การแนะแนวอาชีพ/การเผยแพร่ข่าวสารตลาดแรงงาน',
            '4. การจัดกิจกรรมเชิงวิชาการ',
            '5. การให้บริการสิ่งอำนวยความสะดวกต่อการเรียน/อุปกรณ์การเรียนการสอนที่ทันสมัย',
            '6. การเปิดโอกาสให้นักศึกษาได้ฝึกงานในหน่วยงานที่สามารถประกอบอาชีพต่อได้',
            '7. การจัดสรรทุนการศึกษา/ทุนให้กู้ยืมเพื่อการศึกษา หรือ การดูแลเมื่อนักศึกษาประสบปัญหาทางการเงิน/นักศึกษาประสบภัยพิบัติ'] # ชื่อแต่ละแท่งในแกน X
    VALUES13 = AVG13 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความต้องการ': TYPES13,
        'ค่าความต้องการเฉลี่ย': VALUES13
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความต้องการ', y='ค่าความต้องการเฉลี่ย',
                title='ความต้องการด้านการศึกษา',
                color='ประเภทของการประเมินความต้องการ',
                color_discrete_sequence=COLOR_edu,
                labels={'ค่าความต้องการฉลี่ย': 'ค่าความต้องการเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ####ต้องการสุขภาพ
    TYPES14 = ['1. การช่วยเหลือด้านค่ารักษาพยาบาลให้กับนักศึกษา',
         '2. การบริการตรวจสุขภาพร่างกายและจิตใจ',
         '3. ห้องพยาบาลที่ทันสมัย และอุปกรณ์ปฐมพยาบาลและยาชนิดต่างๆพร้อมให้บริการ',
         '4. อุปกรณ์ช่วยเหลือสำหรับผู้พิการ'] # ค่าแต่ละแท่งในแกน Y
    VALUES14 = AVG14 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความต้องการ': TYPES14,
        'ค่าความต้องการเฉลี่ย': VALUES14
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความต้องการ', y='ค่าความต้องการเฉลี่ย',
                title='ความต้องการเฉลี่ยด้านสุขอนามัย',
                color='ประเภทของการประเมินความต้องการ',
                color_discrete_sequence=COLOR_helth,
                labels={'ค่าความต้องการเฉลี่ย': 'ค่าความต้องการเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ####ต้องการความปลอดภัย
    TYPES15 = ['1. มีเจ้าหน้าที่ดูแลรักษาความปลอดภัยอย่างทั่วถึงและเพียงพอ',
         '2. ป้ายคำเตือน/ข้อควรระวังความปลอดภัยมีความชัดเจนเพื่อหลีกเลี่ยงอุบัติเหตุ',
         '3. การป้องกันการเกิดอุบัติเหตุต่างๆภายในมหาวิทยาลัย',
         '4. การพัฒนาระบบการรักษาความปลอดภัยอย่างต่อเนื่อง/มีประสิทธิภาพ',
         '5. ระบบการควบคุมเข้า-ออกในสถานที่ต่างๆภายในมหาวิทยาลัย'] # ชื่อแต่ละแท่งในแกน X
    VALUES15 = AVG15 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความต้องการ': TYPES15,
        'ค่าความต้องการเฉลี่ย': VALUES15
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความต้องการ', y='ค่าความต้องการเฉลี่ย',
                title='ความต้องการเฉลี่ยด้านการรักษาความปลอดภัย',
                color='ประเภทของการประเมินความต้องการ',
                color_discrete_sequence=COLOR_safety,
                labels={'ค่าความต้องการเฉลี่ย': 'ค่าความต้องการเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    ###ต้องการที่พัก
    TYPES16 = ['1. การมีหอพักที่สะอาดและเพียงพอสำหรับนักศึกษา',
         '2. การมีระบบดูแลความปลอดภัยในบริเวณหอพัก',
         '3. การมีบริการพื้นที่ส่วนกลางที่เอื้ออำนวย',
         '4. เว็บไซต์ Baan TU'] # ชื่อแต่ละแท่งในแกน X
    VALUES16 = AVG16 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความต้องการ': TYPES16,
        'ค่าความต้องการเฉลี่ย': VALUES16
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความต้องการ', y='ค่าความต้องการเฉลี่ย',
                title='ความต้องการเฉลี่ยด้านที่พักอาศัย (เฉพาะผู้ที่พักอาศัยในหอใน ของมหาวิทยาลัยธรรมศาสตร์)',
                color='ประเภทของการประเมินความต้องการ',
                color_discrete_sequence=  COLOR_place,
                labels={'ค่าความต้องการเฉลี่ย': 'ค่าความต้องการเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

    #####ต้องการกิจกรรม
    TYPES17 = ['1. การบริการFitness และสนามกีฬาต่างๆ',
            '2. การมีกิจกรรมชมรมต่างๆให้นักศึกษาเข้าร่วม',
            '3. การจัดกิจกรรมนันทนาการตามเทศกาลต่างๆ',
            '4. การมีบริการห้องสำหรับการทำกิจกรรมต่างๆ เช่น ห้องประชุม/ห้องคาราโอเกะ'] # ชื่อแต่ละแท่งในแกน X
    VALUES17 = AVG17 # ค่าแต่ละแท่งในแกน Y
        # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
            'ประเภทของการประเมินความต้องการ': TYPES17,
            'ค่าความต้องการเฉลี่ย': VALUES17
        }
    df_avg = pd.DataFrame(data)

        # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความต้องการ', y='ค่าความต้องการเฉลี่ย',
                    title='ความต้องการด้านกิจกรรมและนันทนาการ',
                    color='ประเภทของการประเมินความต้องการ',
                    color_discrete_sequence=COLOR_act,
                    labels={'ค่าความต้องการเฉลี่ย': 'ค่าความต้องการเฉลี่ย'},
                    width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

        # กำหนดลักษณะของกรอบ
    fig.update_layout(
            margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
            paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
            plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True) 

    ###ต้องการอาคาร
    TYPES18 = ['1. มีเจ้าหน้าที่อำนวยความสะดวกในบริเวณต่างๆ',
         '2. ทางเดินเท้า/จักรยานที่เพียงพอและปลอดภัย',
         '3. ที่จอดรถอย่างเพียงพอ เหมาะสม',
         '4. ถังขยะที่ถูกสุขลักษณะและเพียงพอ',
         '5. โรงอาหารที่สะอาด มีอาหารที่หลากหลายและถูกหลักอนามัย',
         '6. ห้องสุขาที่เพียงพอและมีการรักษาความสะอาดอยู่เสมอ',
         '7. การมีจุดบริการน้ำดื่มที่สะอาดและเพียงพอ',
         '8. การบริการสถานที่สำหรับพักผ่อน (สวนหย่อม)',
         '9. การบริการยานพาหนะเพื่อการเดินทางที่สะดวก เช่น รถEV,จักรยาน,สกู๊ตเตอร์'] # ชื่อแต่ละแท่งในแกน X
    VALUES18 = AVG18 # ค่าแต่ละแท่งในแกน Y
       # สร้าง DataFrame จากการคำนวณและจัดกลุ่มของข้อมูล
    data = {
        'ประเภทของการประเมินความต้องการ': TYPES18,
        'ค่าความต้องการเฉลี่ย': VALUES18
    }
    df_avg = pd.DataFrame(data)

    # ใช้ Plotly Express เพื่อสร้างกราฟแท่ง
    fig = px.bar(df_avg, x='ประเภทของการประเมินความต้องการ', y='ค่าความต้องการเฉลี่ย',
                title='ความต้องการด้านการศึกษา',
                color='ประเภทของการประเมินความต้องการ',
                color_discrete_sequence=COLOR_place,
                labels={'ค่าความต้องการเฉลี่ย': 'ค่าความต้องการเฉลี่ย'},
                width=900, height=750)

    fig.update_traces(marker_line_color='rgb(8,48,107)', marker_line_width=1.5, opacity=0.6) # ปรับการแสดงผลของแท่งและเส้นขอบแต่ละแท่ง

    # กำหนดลักษณะของกรอบ
    fig.update_layout(
        margin=dict(l=50, r=50, t=50, b=50), # ระยะห่างของกราฟ
        paper_bgcolor='rgba(0,0,0,0)', # สีพื้นหลังกราฟ
        plot_bgcolor='rgba(0,0,0,0)' # สีพื้นหลังของพื้นที่ plot
    )

    st.plotly_chart(fig,use_container_width=True)

#################################################################################
st.markdown('### สวัสดิการและสิ่งอำนวยความสะดวกที่อยากให้มีเพิ่มเติม')

text = filter_df['1. คุณอยากให้มีสวัสดิการอะไรเพิ่มเติมในมหาวิทยาลัย']

st.write(text)



    

